tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1789_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16LF1789_H_
#define _PIC16LF1789_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define RA6                           42
#define RA7                           43
#define PORTB                         44
#define RB0                           45
#define RB1                           46
#define RB2                           47
#define RB3                           48
#define RB4                           49
#define RB5                           50
#define RB6                           51
#define RB7                           52
#define RC0                           53
#define PORTC                         54
#define RC1                           55
#define RC2                           56
#define RC3                           57
#define RC4                           58
#define RC5                           59
#define RC6                           60
#define RC7                           61
#define RD0                           62
#define PORTD                         63
#define RD1                           64
#define RD2                           65
#define RD3                           66
#define RD4                           67
#define RD5                           68
#define RD6                           69
#define RD7                           70
#define RE0                           71
#define PORTE                         72
#define RE1                           73
#define RE2                           74
#define RE3                           75
#define PIR1                          76
#define TMR1IF                        77
#define TMR2IF                        78
#define CCP1IF                        79
#define SSP1IF                        80
#define TXIF                          81
#define RCIF                          82
#define ADIF                          83
#define TMR1GIF                       84
#define PIR2                          85
#define CCP2IF                        86
#define C3IF                          87
#define C4IF                          88
#define BCL1IF                        89
#define EEIF                          90
#define C1IF                          91
#define C2IF                          92
#define OSFIF                         93
#define PIR3                          94
#define CCP3IF                        95
#define PIR4                          96
#define PSMC1SIF                      97
#define PSMC2SIF                      98
#define PSMC3SIF                      99
#define PSMC4SIF                      100
#define PSMC1TIF                      101
#define PSMC2TIF                      102
#define PSMC3TIF                      103
#define PSMC4TIF                      104
#define TMR0                          105
#define TMR1L                         106
#define TMR1H                         107
#define T1CON                         108
#define TMR1ON                        109
#define nT1SYNC                       110
#define T1OSCEN                       111
#define T1CKPS0                       112
#define T1CKPS                        113
#define T1CKPS1                       114
#define TMR1CS                        115
#define TMR1CS0                       116
#define TMR1CS1                       117
#define T1GCON                        118
#define T1GSS0                        119
#define T1GSS                         120
#define T1GSS1                        121
#define T1GVAL                        122
#define T1GGO                         123
#define T1GSPM                        124
#define T1GTM                         125
#define T1GPOL                        126
#define TMR1GE                        127
#define TMR2                          128
#define PR2                           129
#define T2CON                         130
#define T2CKPS0                       131
#define T2CKPS                        132
#define T2CKPS1                       133
#define TMR2ON                        134
#define T2OUTPS0                      135
#define T2OUTPS                       136
#define T2OUTPS1                      137
#define T2OUTPS2                      138
#define T2OUTPS3                      139
#define TRISA                         140
#define TRISA0                        141
#define TRISA1                        142
#define TRISA2                        143
#define TRISA3                        144
#define TRISA4                        145
#define TRISA5                        146
#define TRISA6                        147
#define TRISA7                        148
#define TRISB                         149
#define TRISB0                        150
#define TRISB1                        151
#define TRISB2                        152
#define TRISB3                        153
#define TRISB4                        154
#define TRISB5                        155
#define TRISB6                        156
#define TRISB7                        157
#define TRISC                         158
#define TRISC0                        159
#define TRISC1                        160
#define TRISC2                        161
#define TRISC3                        162
#define TRISC4                        163
#define TRISC5                        164
#define TRISC6                        165
#define TRISC7                        166
#define TRISD0                        167
#define TRISD                         168
#define TRISD1                        169
#define TRISD2                        170
#define TRISD3                        171
#define TRISD4                        172
#define TRISD5                        173
#define TRISD6                        174
#define TRISD7                        175
#define TRISE                         176
#define TRISE0                        177
#define TRISE1                        178
#define TRISE2                        179
#define TRISE3                        180
#define PIE1                          181
#define TMR1IE                        182
#define TMR2IE                        183
#define CCP1IE                        184
#define SSP1IE                        185
#define TXIE                          186
#define RCIE                          187
#define ADIE                          188
#define TMR1GIE                       189
#define PIE2                          190
#define CCP2IE                        191
#define C3IE                          192
#define C4IE                          193
#define BCL1IE                        194
#define EEIE                          195
#define C1IE                          196
#define C2IE                          197
#define OSFIE                         198
#define PIE3                          199
#define CCP3IE                        200
#define PIE4                          201
#define PSMC1SIE                      202
#define PSMC2SIE                      203
#define PSMC3SIE                      204
#define PSMC4SIE                      205
#define PSMC1TIE                      206
#define PSMC2TIE                      207
#define PMSC3TIE                      208
#define PSMC3TIE                      209
#define PSMC4TIE                      210
#define OPTION_REG                    211
#define PS                            212
#define PS0                           213
#define PS1                           214
#define PS2                           215
#define PSA                           216
#define T0SE                          217
#define TMR0SE                        218
#define T0CS                          219
#define TMR0CS                        220
#define INTEDG                        221
#define nWPUEN                        222
#define PCON                          223
#define nBOR                          224
#define nPOR                          225
#define nRI                           226
#define nRMCLR                        227
#define nRWDT                         228
#define STKUNF                        229
#define STKOVF                        230
#define WDTCON                        231
#define SWDTEN                        232
#define WDTPS                         233
#define WDTPS0                        234
#define WDTPS1                        235
#define WDTPS2                        236
#define WDTPS3                        237
#define WDTPS4                        238
#define OSCTUNE                       239
#define TUN0                          240
#define TUN                           241
#define TUN1                          242
#define TUN2                          243
#define TUN3                          244
#define TUN4                          245
#define TUN5                          246
#define OSCCON                        247
#define SCS0                          248
#define SCS                           249
#define SCS1                          250
#define IRCF                          251
#define IRCF0                         252
#define IRCF1                         253
#define IRCF2                         254
#define IRCF3                         255
#define SPLLEN                        256
#define OSCSTAT                       257
#define HFIOFS                        258
#define LFIOFR                        259
#define MFIOFR                        260
#define HFIOFL                        261
#define HFIOFR                        262
#define OSTS                          263
#define PLLR                          264
#define T1OSCR                        265
#define ADRESL                        266
#define ADRESH                        267
#define ADCON0                        268
#define ADON                          269
#define GO_nDONE                      270
#define DONE                          271
#define GO                            272
#define ADGO                          273
#define CHS0                          274
#define CHS                           275
#define CHS1                          276
#define CHS2                          277
#define CHS3                          278
#define CHS4                          279
#define ADRMD                         280
#define ADCON1                        281
#define ADPREF0                       282
#define ADPREF                        283
#define ADPREF1                       284
#define ADNREF                        285
#define ADCS0                         286
#define ADCS                          287
#define ADCS1                         288
#define ADCS2                         289
#define ADFM                          290
#define ADCON2                        291
#define CHSN0                         292
#define CHSN                          293
#define CHSN1                         294
#define CHSN2                         295
#define CHSN3                         296
#define TRIGSEL                       297
#define TRIGSEL0                      298
#define TRIGSEL1                      299
#define TRIGSEL2                      300
#define TRIGSEL3                      301
#define LATA0                         302
#define LATA                          303
#define LATA1                         304
#define LATA2                         305
#define LATA3                         306
#define LATA4                         307
#define LATA5                         308
#define LATA6                         309
#define LATA7                         310
#define LATB0                         311
#define LATB                          312
#define LATB1                         313
#define LATB2                         314
#define LATB3                         315
#define LATB4                         316
#define LATB5                         317
#define LATB6                         318
#define LATB7                         319
#define LATC0                         320
#define LATC                          321
#define LATC1                         322
#define LATC2                         323
#define LATC3                         324
#define LATC4                         325
#define LATC5                         326
#define LATC6                         327
#define LATC7                         328
#define LATD0                         329
#define LATD                          330
#define LATD1                         331
#define LATD2                         332
#define LATD3                         333
#define LATD4                         334
#define LATD5                         335
#define LATD6                         336
#define LATD7                         337
#define LATE0                         338
#define LATE                          339
#define LATE1                         340
#define LATE2                         341
#define CM1CON0                       342
#define C1SYNC                        343
#define C1HYS                         344
#define C1SP                          345
#define C1ZLF                         346
#define C1POL                         347
#define C1OE                          348
#define C1OUT                         349
#define C1ON                          350
#define CM1CON1                       351
#define C1NCH0                        352
#define C1NCH                         353
#define C1NCH1                        354
#define C1NCH2                        355
#define C1PCH                         356
#define C1PCH0                        357
#define C1PCH1                        358
#define C1PCH2                        359
#define C1INTN                        360
#define C1INTP                        361
#define CM2CON0                       362
#define C2SYNC                        363
#define C2HYS                         364
#define C2SP                          365
#define C2ZLF                         366
#define C2POL                         367
#define C2OE                          368
#define C2OUT                         369
#define C2ON                          370
#define CM2CON1                       371
#define C2NCH0                        372
#define C2NCH                         373
#define C2NCH1                        374
#define C2NCH2                        375
#define C2PCH                         376
#define C2PCH0                        377
#define C2PCH1                        378
#define C2PCH2                        379
#define C2INTN                        380
#define C2INTP                        381
#define CMOUT                         382
#define MC1OUT                        383
#define MC2OUT                        384
#define MC3OUT                        385
#define MC4OUT                        386
#define BORCON                        387
#define BORRDY                        388
#define BORFS                         389
#define SBOREN                        390
#define FVRCON                        391
#define ADFVR0                        392
#define ADFVR                         393
#define ADFVR1                        394
#define CDAFVR0                       395
#define CDAFVR                        396
#define CDAFVR1                       397
#define TSRNG                         398
#define TSEN                          399
#define FVRRDY                        400
#define FVREN                         401
#define DAC1CON0                      402
#define DACNSS                        403
#define DAC1NSS                       404
#define DACPSS                        405
#define DACPSS0                       406
#define DAC1PSS                       407
#define DAC1PSS0                      408
#define DACPSS1                       409
#define DAC1PSS1                      410
#define DACOE0                        411
#define DAC1OE2                       412
#define DAC1OE1                       413
#define DACOE1                        414
#define DACEN                         415
#define DAC1EN                        416
#define DAC1CON1                      417
#define DAC1R                         418
#define DACR0                         419
#define DAC1R0                        420
#define DACR1                         421
#define DAC1R1                        422
#define DACR2                         423
#define DAC1R2                        424
#define DACR3                         425
#define DAC1R3                        426
#define DACR4                         427
#define DAC1R4                        428
#define DACR5                         429
#define DAC1R5                        430
#define DACR6                         431
#define DAC1R6                        432
#define DACR7                         433
#define DAC1R7                        434
#define CM4CON0                       435
#define C4SYNC                        436
#define C4HYS                         437
#define C4SP                          438
#define C4ZLF                         439
#define C4POL                         440
#define C4OE                          441
#define C4OUT                         442
#define C4ON                          443
#define CM4CON1                       444
#define C4NCH0                        445
#define C4NCH                         446
#define C4NCH1                        447
#define C4NCH2                        448
#define C4PCH0                        449
#define C4PCH                         450
#define C4PCH1                        451
#define C4PCH2                        452
#define C4INTN                        453
#define C4INTP                        454
#define APFCON2                       455
#define CCP3SEL                       456
#define SSSEL                         457
#define APFCON1                       458
#define CCP2SEL                       459
#define RXSEL                         460
#define TXSEL                         461
#define SDISEL                        462
#define SCKSEL                        463
#define SDOSEL                        464
#define CCP1SEL                       465
#define C2OUTSEL                      466
#define CM3CON0                       467
#define C3SYNC                        468
#define C3HYS                         469
#define C3SP                          470
#define C3ZLF                         471
#define C3POL                         472
#define C3OE                          473
#define C3OUT                         474
#define C3ON                          475
#define CM3CON1                       476
#define C3NCH                         477
#define C3NCH0                        478
#define C3NCH1                        479
#define C3NCH2                        480
#define C3PCH                         481
#define C3PCH0                        482
#define C3PCH1                        483
#define C3PCH2                        484
#define C3INTN                        485
#define C3INTP                        486
#define ANSA0                         487
#define ANSELA                        488
#define ANSA1                         489
#define ANSA2                         490
#define ANSA3                         491
#define ANSA4                         492
#define ANSA5                         493
#define ANSA7                         494
#define ANSB0                         495
#define ANSELB                        496
#define ANSB1                         497
#define ANSB2                         498
#define ANSB3                         499
#define ANSB4                         500
#define ANSB5                         501
#define ANSB6                         502
#define ANSELC                        503
#define ANSC0                         504
#define ANSC1                         505
#define ANSC2                         506
#define ANSC3                         507
#define ANSC4                         508
#define ANSC5                         509
#define ANSC6                         510
#define ANSC7                         511
#define ANSELD                        512
#define ANSD                          513
#define ANSD0                         514
#define ANSD1                         515
#define ANSD2                         516
#define ANSELE                        517
#define ANSE                          518
#define ANSE0                         519
#define ANSE1                         520
#define ANSE2                         521
