tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1789_tdd.h
#define EEADRL                        522
#define EEADRH                        523
#define EEDATL                        524
#define EEDATH                        525
#define EECON1                        526
#define RD                            527
#define WR                            528
#define WREN                          529
#define WRERR                         530
#define FREE                          531
#define LWLO                          532
#define CFGS                          533
#define EEPGD                         534
#define EECON2                        535
#define RC1REG                        536
#define TX1REG                        537
#define SP1BRGL                       538
#define SP1BRGH                       539
#define RC1STA                        540
#define RX9D                          541
#define OERR                          542
#define FERR                          543
#define ADDEN                         544
#define CREN                          545
#define SREN                          546
#define RX9                           547
#define SPEN                          548
#define TX1STA                        549
#define TX9D                          550
#define TRMT                          551
#define BRGH                          552
#define SENDB                         553
#define SYNC                          554
#define TXEN                          555
#define TX9                           556
#define CSRC                          557
#define BAUD1CON                      558
#define ABDEN                         559
#define WUE                           560
#define BRG16                         561
#define SCKP                          562
#define RCIDL                         563
#define ABDOVF                        564
#define WPUA0                         565
#define WPUA                          566
#define WPUA1                         567
#define WPUA2                         568
#define WPUA3                         569
#define WPUA4                         570
#define WPUA5                         571
#define WPUA6                         572
#define WPUA7                         573
#define WPUB0                         574
#define WPUB                          575
#define WPUB1                         576
#define WPUB2                         577
#define WPUB3                         578
#define WPUB4                         579
#define WPUB5                         580
#define WPUB6                         581
#define WPUB7                         582
#define WPUC0                         583
#define WPUC                          584
#define WPUC1                         585
#define WPUC2                         586
#define WPUC3                         587
#define WPUC4                         588
#define WPUC5                         589
#define WPUC6                         590
#define WPUC7                         591
#define WPUD                          592
#define WPUD0                         593
#define WPUD1                         594
#define WPUD2                         595
#define WPUD3                         596
#define WPUD4                         597
#define WPUD5                         598
#define WPUD6                         599
#define WPUD7                         600
#define WPUE                          601
#define WPUE0                         602
#define WPUE1                         603
#define WPUE2                         604
#define WPUE3                         605
#define SSP1BUF                       606
#define BUF                           607
#define BUF0                          608
#define SSP1BUF0                      609
#define BUF1                          610
#define SSP1BUF1                      611
#define BUF2                          612
#define SSP1BUF2                      613
#define BUF3                          614
#define SSP1BUF3                      615
#define BUF4                          616
#define SSP1BUF4                      617
#define BUF5                          618
#define SSP1BUF5                      619
#define BUF6                          620
#define SSP1BUF6                      621
#define BUF7                          622
#define SSP1BUF7                      623
#define ADD0                          624
#define ADD                           625
#define SSP1ADD0                      626
#define SSP1ADD                       627
#define ADD1                          628
#define SSP1ADD1                      629
#define ADD2                          630
#define SSP1ADD2                      631
#define ADD3                          632
#define SSP1ADD3                      633
#define ADD4                          634
#define SSP1ADD4                      635
#define ADD5                          636
#define SSP1ADD5                      637
#define ADD6                          638
#define SSP1ADD6                      639
#define ADD7                          640
#define SSP1ADD7                      641
#define SSP1MSK0                      642
#define SSP1MSK                       643
#define MSK0                          644
#define MSK                           645
#define SSP1MSK1                      646
#define MSK1                          647
#define SSP1MSK2                      648
#define MSK2                          649
#define SSP1MSK3                      650
#define MSK3                          651
#define SSP1MSK4                      652
#define MSK4                          653
#define SSP1MSK5                      654
#define MSK5                          655
#define SSP1MSK6                      656
#define MSK6                          657
#define SSP1MSK7                      658
#define MSK7                          659
#define SSP1STAT                      660
#define BF                            661
#define UA                            662
#define R_nW                          663
#define S                             664
#define P                             665
#define D_nA                          666
#define CKE                           667
#define SMP                           668
#define SSP1CON1                      669
#define SSPM0                         670
#define SSPM                          671
#define SSPM1                         672
#define SSPM2                         673
#define SSPM3                         674
#define CKP                           675
#define SSPEN                         676
#define SSPOV                         677
#define WCOL                          678
#define SSP1CON2                      679
#define SEN                           680
#define RSEN                          681
#define PEN                           682
#define RCEN                          683
#define ACKEN                         684
#define ACKDT                         685
#define ACKSTAT                       686
#define GCEN                          687
#define SSP1CON3                      688
#define DHEN                          689
#define AHEN                          690
#define SBCDE                         691
#define SDAHT                         692
#define BOEN                          693
#define SCIE                          694
#define PCIE                          695
#define ACKTIM                        696
#define ODCONA0                       697
#define ODCONA                        698
#define ODCONA1                       699
#define ODCONA2                       700
#define ODCONA3                       701
#define ODCONA4                       702
#define ODCONA5                       703
#define ODCONA6                       704
#define ODCONA7                       705
#define ODCONB0                       706
#define ODCONB                        707
#define ODCONB1                       708
#define ODCONB2                       709
#define ODCONB3                       710
#define ODCONB4                       711
#define ODCONB5                       712
#define ODCONB6                       713
#define ODCONB7                       714
#define ODCONC0                       715
#define ODCONC                        716
#define ODCONC1                       717
#define ODCONC2                       718
#define ODCONC3                       719
#define ODCONC4                       720
#define ODCONC5                       721
#define ODCONC6                       722
#define ODCONC7                       723
#define ODCOND0                       724
#define ODCOND                        725
#define ODCOND1                       726
#define ODCOND2                       727
#define ODCOND3                       728
#define ODCOND4                       729
#define ODCOND5                       730
#define ODCOND6                       731
#define ODCOND7                       732
#define ODCONE0                       733
#define ODCONE                        734
#define ODCONE1                       735
#define ODCONE2                       736
#define CCPR1L                        737
#define CCPR1H                        738
#define CCP1CON                       739
#define CCP1M0                        740
#define CCP1M                         741
#define CCP1M1                        742
#define CCP1M2                        743
#define CCP1M3                        744
#define DC1B                          745
#define DC1B0                         746
#define DC1B1                         747
#define CCPR2L                        748
#define CCPR2H                        749
#define CCP2CON                       750
#define CCP2M                         751
#define CCP2M0                        752
#define CCP2M1                        753
#define CCP2M2                        754
#define CCP2M3                        755
#define DC2B0                         756
#define DC2B                          757
#define DC2B1                         758
#define SLRCONA0                      759
#define SLRCONA                       760
#define SLRCONA1                      761
#define SLRCONA2                      762
#define SLRCONA3                      763
#define SLRCONA4                      764
#define SLRCONA5                      765
#define SLRCONA6                      766
#define SLRCONA7                      767
#define SLRCONB                       768
#define SLRCONB0                      769
#define SLRCONB1                      770
#define SLRCONB2                      771
#define SLRCONB3                      772
#define SLRCONB4                      773
#define SLRCONB5                      774
#define SLRCONB6                      775
#define SLRCONB7                      776
#define SLRCONC                       777
#define SLRCONC0                      778
#define SLRCONC1                      779
#define SLRCONC2                      780
#define SLRCONC3                      781
#define SLRCONC4                      782
#define SLRCONC5                      783
#define SLRCONC6                      784
#define SLRCONC7                      785
#define SLRCOND0                      786
#define SLRCOND                       787
#define SLRCOND1                      788
#define SLRCOND2                      789
#define SLRCOND3                      790
#define SLRCOND4                      791
#define SLRCOND5                      792
#define SLRCOND6                      793
#define SLRCOND7                      794
#define SLRCONE0                      795
#define SLRCONE                       796
#define SLRCONE1                      797
#define SLRCONE2                      798
#define CCPR3L                        799
#define CCPR3H                        800
#define CCP3CON                       801
#define CCP3M                         802
#define CCP3M0                        803
#define CCP3M1                        804
#define CCP3M2                        805
#define CCP3M3                        806
#define DC3B                          807
#define DC3B0                         808
#define DC3B1                         809
#define INLVLA                        810
#define INLVLA0                       811
#define INLVLA1                       812
#define INLVLA2                       813
#define INLVLA3                       814
#define INLVLA4                       815
#define INLVLA5                       816
#define INLVLA6                       817
#define INLVLA7                       818
#define INLVLB                        819
#define INLVLB0                       820
#define INLVLB1                       821
#define INLVLB2                       822
#define INLVLB3                       823
#define INLVLB4                       824
#define INLVLB5                       825
#define INLVLB6                       826
#define INLVLB7                       827
#define INLVLC                        828
#define INLVLC0                       829
#define INLVLC1                       830
#define INLVLC2                       831
#define INLVLC3                       832
#define INLVLC4                       833
#define INLVLC5                       834
#define INLVLC6                       835
#define INLVLC7                       836
#define INLVLD0                       837
#define INLVLD                        838
#define INLVLD1                       839
#define INLVLD2                       840
#define INLVLD3                       841
#define INLVLD4                       842
#define INLVLD5                       843
#define INLVLD6                       844
#define INLVLD7                       845
#define INLVLE                        846
#define INLVLE0                       847
#define INLVLE1                       848
#define INLVLE2                       849
#define INLVLE3                       850
#define IOCAP                         851
#define IOCAP0                        852
#define IOCAP1                        853
#define IOCAP2                        854
#define IOCAP3                        855
#define IOCAP4                        856
#define IOCAP5                        857
#define IOCAP6                        858
#define IOCAP7                        859
#define IOCAN                         860
#define IOCAN0                        861
#define IOCAN1                        862
#define IOCAN2                        863
#define IOCAN3                        864
#define IOCAN4                        865
#define IOCAN5                        866
#define IOCAN6                        867
#define IOCAN7                        868
#define IOCAF0                        869
#define IOCAF                         870
#define IOCAF1                        871
#define IOCAF2                        872
#define IOCAF3                        873
#define IOCAF4                        874
#define IOCAF5                        875
#define IOCAF6                        876
#define IOCAF7                        877
#define IOCBP                         878
#define IOCBP0                        879
#define IOCBP1                        880
#define IOCBP2                        881
#define IOCBP3                        882
#define IOCBP4                        883
#define IOCBP5                        884
#define IOCBP6                        885
#define IOCBP7                        886
#define IOCBN0                        887
#define IOCBN                         888
#define IOCBN1                        889
#define IOCBN2                        890
#define IOCBN3                        891
#define IOCBN4                        892
#define IOCBN5                        893
#define IOCBN6                        894
#define IOCBN7                        895
#define IOCBF0                        896
#define IOCBF                         897
#define IOCBF1                        898
#define IOCBF2                        899
#define IOCBF3                        900
#define IOCBF4                        901
#define IOCBF5                        902
#define IOCBF6                        903
#define IOCBF7                        904
#define IOCCP0                        905
#define IOCCP                         906
#define IOCCP1                        907
#define IOCCP2                        908
#define IOCCP3                        909
#define IOCCP4                        910
#define IOCCP5                        911
#define IOCCP6                        912
#define IOCCP7                        913
#define IOCCN0                        914
#define IOCCN                         915
#define IOCCN1                        916
#define IOCCN2                        917
#define IOCCN3                        918
#define IOCCN4                        919
#define IOCCN5                        920
#define IOCCN6                        921
#define IOCCN7                        922
#define IOCCF0                        923
#define IOCCF                         924
#define IOCCF1                        925
#define IOCCF2                        926
#define IOCCF3                        927
#define IOCCF4                        928
#define IOCCF5                        929
#define IOCCF6                        930
#define IOCCF7                        931
#define IOCEP                         932
#define IOCEP3                        933
#define IOCEN                         934
#define IOCEN3                        935
#define IOCEF                         936
#define IOCEF3                        937
#define OPA1CON                       938
#define OPA1CON_PCH                   939
#define OPA1PCH                       940
#define OPA1CON_PCH0                  941
#define OPA1PCH0                      942
#define OPA1CON_PCH1                  943
#define OPA1PCH1                      944
#define OPA1PCH2                      945
#define OPA1CON_PCH2                  946
#define OPA1CON_SP                    947
#define OPA1SP                        948
#define OPA1CON_EN                    949
#define OPA1EN                        950
#define OPA2CON                       951
#define OPA2CON_PCH                   952
#define OPA2CON_PCH0                  953
#define OPA2PCH                       954
#define OPA2PCH0                      955
#define OPA2CON_PCH1                  956
#define OPA2PCH1                      957
#define OPA2CON_PCH2                  958
#define OPA2PCH2                      959
#define OPA2CON_SP                    960
#define OPA2SP                        961
#define OPA2EN                        962
#define OPA2CON_EN                    963
#define OPA3CON                       964
#define OPA3CON_PCH0                  965
#define OPA3CON_PCH                   966
#define OPA3PCH                       967
#define OPA3PCH0                      968
#define OPA3CON_PCH1                  969
#define OPA3PCH1                      970
#define OPA3CON_PCH2                  971
#define OPA3PCH2                      972
#define OPA3SP                        973
#define OPA3CON_SP                    974
#define OPA3CON_EN                    975
#define OPA3EN                        976
#define CLKRCON                       977
#define CLKRDIV                       978
#define CLKRDIV0                      979
#define CLKRDIV1                      980
#define CLKRDIV2                      981
#define CLKRDC                        982
#define CLKRDC0                       983
#define CLKRDC1                       984
#define CLKRSLR                       985
#define CLKROE                        986
#define CLKREN                        987
#define DAC2CON0                      988
#define DAC2PSS                       989
#define DAC2OE2                       990
#define DAC2OE1                       991
#define DAC2EN                        992
#define DAC2REF                       993
#define DAC2R                         994
#define DAC3CON0                      995
#define DAC3PSS                       996
#define DAC3OE2                       997
#define DAC3OE1                       998
#define DAC3EN                        999
#define DAC3REF                       1000
#define DAC3R                         1001
#define DAC4CON0                      1002
#define DAC4PSS                       1003
#define DAC4OE2                       1004
#define DAC4OE1                       1005
#define DAC4EN                        1006
#define DAC4REF                       1007
#define DAC4R                         1008
#define PSMC1CON                      1009
#define P1MODE                        1010
#define P1MODE0                       1011
#define P1MODE1                       1012
#define P1MODE2                       1013
#define P1MODE3                       1014
#define P1DBRE                        1015
#define P1DBFE                        1016
#define PSMC1LD                       1017
#define PSMC1EN                       1018
#define PSMC1MDL                      1019
#define P1MSRC0                       1020
#define P1MSRC                        1021
#define P1MSRC1                       1022
#define P1MSRC2                       1023
#define P1MSRC3                       1024
#define P1MDLBIT                      1025
#define P1MDLPOL                      1026
#define P1MDLEN                       1027
#define PSMC1SYNC                     1028
#define P1SYNC0                       1029
#define P1SYNC1                       1030
#define P1SYNC2                       1031
#define P1DCPOL                       1032
#define P1PRPOL                       1033
#define P1POFST                       1034
#define PSMC1CLK                      1035
#define P1CSRC                        1036
#define P1CSRC0                       1037
#define P1CSRC1                       1038
#define P1CPRE                        1039
#define P1CPRE0                       1040
#define P1CPRE1                       1041
#define PSMC1OEN                      1042
#define P1OEA                         1043
#define P1OEB                         1044
#define P1OEC                         1045
#define P1OED                         1046
#define P1OEE                         1047
#define P1OEF                         1048
#define PSMC1POL                      1049
#define P1POLA                        1050
#define P1POLB                        1051
#define P1POLC                        1052
#define P1POLD                        1053
#define P1POLE                        1054
#define P1POLF                        1055
#define P1INPOL                       1056
#define PSMC1BLNK                     1057
#define P1REBM                        1058
#define P1REBM0                       1059
#define P1REBM1                       1060
#define P1FEBM0                       1061
#define P1FEBM                        1062
#define P1FEBM1                       1063
#define PSMC1REBS                     1064
#define P1REBSC1                      1065
#define P1REBSC2                      1066
#define P1REBSC3                      1067
#define P1REBSC4                      1068
#define P1REBSIN                      1069
#define PSMC1FEBS                     1070
#define P1FEBSC1                      1071
#define P1FEBSC2                      1072
#define P1FEBSC3                      1073
#define P1FEBSC4                      1074
#define P1FEBSIN                      1075
#define PSMC1PHS                      1076
#define P1PHST                        1077
#define P1PHSC1                       1078
#define P1PHSC2                       1079
#define P1PHSC3                       1080
#define P1PHSC4                       1081
#define P1PHSIN                       1082
#define PSMC1DCS                      1083
#define P1DCST                        1084
#define P1DCSC1                       1085
#define P1DCSC2                       1086
#define P1DCSC3                       1087
#define P1DCSC4                       1088
#define P1DCSIN                       1089
#define PSMC1PRS                      1090
