tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1789_tdd.h
#define P1PRST                        1091
#define P1PRSC1                       1092
#define P1PRSC2                       1093
#define P1PRSC3                       1094
#define P1PRSC4                       1095
#define P1PRSIN                       1096
#define PSMC1ASDC                     1097
#define P1ASDOV                       1098
#define P1ARSEN                       1099
#define P1ASDEN                       1100
#define P1ASE                         1101
#define PSMC1ASDL                     1102
#define P1ASDLA                       1103
#define P1ASDLB                       1104
#define P1ASDLC                       1105
#define P1ASDLD                       1106
#define P1ASDLE                       1107
#define P1ASDLF                       1108
#define PSMC1ASDS                     1109
#define P1ASDSC1                      1110
#define P1ASDSC2                      1111
#define P1ASDSC3                      1112
#define P1ASDSC4                      1113
#define P1ASDSIN                      1114
#define PSMC1INT                      1115
#define P1TPRIF                       1116
#define P1TDCIF                       1117
#define P1TPHIF                       1118
#define P1TOVIF                       1119
#define P1TPRIE                       1120
#define P1TDCIE                       1121
#define P1TPHIE                       1122
#define P1TOVIE                       1123
#define PSMC1PHL                      1124
#define PSMC1PH0                      1125
#define PSMC1PH1                      1126
#define PSMC1PH2                      1127
#define PSMC1PH3                      1128
#define PSMC1PH4                      1129
#define PSMC1PH5                      1130
#define PSMC1PH6                      1131
#define PSMC1PH7                      1132
#define PSMC1PHH                      1133
#define PSMC1PH8                      1134
#define PSMC1PH9                      1135
#define PSMC1PH10                     1136
#define PSMC1PH11                     1137
#define PSMC1PH12                     1138
#define PSMC1PH13                     1139
#define PSMC1PH14                     1140
#define PSMC1PH15                     1141
#define PSMC1DCL                      1142
#define PSMC1DC0                      1143
#define PSMC1DC1                      1144
#define PSMC1DC2                      1145
#define PSMC1DC3                      1146
#define PSMC1DC4                      1147
#define PSMC1DC5                      1148
#define PSMC1DC6                      1149
#define PSMC1DC7                      1150
#define PSMC1DCH                      1151
#define PSMC1DC8                      1152
#define PSMC1DC9                      1153
#define PSMC1DC10                     1154
#define PSMC1DC11                     1155
#define PSMC1DC12                     1156
#define PSMC1DC13                     1157
#define PSMC1DC14                     1158
#define PSMC1DC15                     1159
#define PSMC1PRL                      1160
#define PSMC1PR0                      1161
#define PSMC1PR1                      1162
#define PSMC1PR2                      1163
#define PSMC1PR3                      1164
#define PSMC1PR4                      1165
#define PSMC1PR5                      1166
#define PSMC1PR6                      1167
#define PSMC1PR7                      1168
#define PSMC1PRH                      1169
#define PSMC1PR8                      1170
#define PSMC1PR9                      1171
#define PSMC1PR10                     1172
#define PSMC1PR11                     1173
#define PSMC1PR12                     1174
#define PSMC1PR13                     1175
#define PSMC1PR14                     1176
#define PSMC1PR15                     1177
#define PSMC1TMRL                     1178
#define PSMC1TMR0                     1179
#define PSMC1TMR1                     1180
#define PSMC1TMR2                     1181
#define PSMC1TMR3                     1182
#define PSMC1TMR4                     1183
#define PSMC1TMR5                     1184
#define PSMC1TMR6                     1185
#define PSMC1TMR7                     1186
#define PSMC1TMRH                     1187
#define PSMC1TMR8                     1188
#define PSMC1TMR9                     1189
#define PSMC1TMR10                    1190
#define PSMC1TMR11                    1191
#define PSMC1TMR12                    1192
#define PSMC1TMR13                    1193
#define PSMC1TMR14                    1194
#define PSMC1TMR15                    1195
#define PSMC1DBR                      1196
#define PSMC1DBR0                     1197
#define PSMC1DBR1                     1198
#define PSMC1DBR2                     1199
#define PSMC1DBR3                     1200
#define PSMC1DBR4                     1201
#define PSMC1DBR5                     1202
#define PSMC1DBR6                     1203
#define PSMC1DBR7                     1204
#define PSMC1DBF                      1205
#define PSMC1DBF0                     1206
#define PSMC1DBF1                     1207
#define PSMC1DBF2                     1208
#define PSMC1DBF3                     1209
#define PSMC1DBF4                     1210
#define PSMC1DBF5                     1211
#define PSMC1DBF6                     1212
#define PSMC1DBF7                     1213
#define PSMC1BLKR                     1214
#define PSMC1BLKR0                    1215
#define PSMC1BLKR1                    1216
#define PSMC1BLKR2                    1217
#define PSMC1BLKR3                    1218
#define PSMC1BLKR4                    1219
#define PSMC1BLKR5                    1220
#define PSMC1BLKR6                    1221
#define PSMC1BLKR7                    1222
#define PSMC1BLKF                     1223
#define PSMC1BLKF0                    1224
#define PSMC1BLKF1                    1225
#define PSMC1BLKF2                    1226
#define PSMC1BLKF3                    1227
#define PSMC1BLKF4                    1228
#define PSMC1BLKF5                    1229
#define PSMC1BLKF6                    1230
#define PSMC1BLKF7                    1231
#define PSMC1FFA                      1232
#define PSMC1FFA0                     1233
#define PSMC1FFA1                     1234
#define PSMC1FFA2                     1235
#define PSMC1FFA3                     1236
#define PSMC1STR0                     1237
#define P1STRA                        1238
#define P1STRB                        1239
#define P1STRC                        1240
#define P1STRD                        1241
#define P1STRE                        1242
#define P1STRF                        1243
#define PSMC1STR1                     1244
#define P1HSMEN                       1245
#define P1LSMEN                       1246
#define P1SSYNC                       1247
#define PSMC2CON                      1248
#define P2MODE                        1249
#define P2MODE0                       1250
#define P2MODE1                       1251
#define P2MODE2                       1252
#define P2MODE3                       1253
#define P2DBRE                        1254
#define P2DBFE                        1255
#define PSMC2LD                       1256
#define PSMC2EN                       1257
#define PSMC2MDL                      1258
#define P2MSRC                        1259
#define P2MSRC0                       1260
#define P2MSRC1                       1261
#define P2MSRC2                       1262
#define P2MSRC3                       1263
#define P2MDLBIT                      1264
#define P2MDLPOL                      1265
#define P2MDLEN                       1266
#define PSMC2SYNC                     1267
#define P2SYNC0                       1268
#define P2SYNC1                       1269
#define P2SYNC2                       1270
#define P2DCPOL                       1271
#define P2PRPOL                       1272
#define P2POFST                       1273
#define PSMC2CLK                      1274
#define P2CSRC0                       1275
#define P2CSRC                        1276
#define P2CSRC1                       1277
#define P2CPRE                        1278
#define P2CPRE0                       1279
#define P2CPRE1                       1280
#define PSMC2OEN                      1281
#define P2OEA                         1282
#define P2OEB                         1283
#define PSMC2POL                      1284
#define P2POLA                        1285
#define P2POLB                        1286
#define P2INPOL                       1287
#define PSMC2BLNK                     1288
#define P2REBM                        1289
#define P2REBM0                       1290
#define P2REBM1                       1291
#define P2FEBM0                       1292
#define P2FEBM                        1293
#define P2FEBM1                       1294
#define PSMC2REBS                     1295
#define P2REBSC1                      1296
#define P2REBSC2                      1297
#define P2REBSC3                      1298
#define P2REBSC4                      1299
#define P2REBSIN                      1300
#define PSMC2FEBS                     1301
#define P2FEBSC1                      1302
#define P2FEBSC2                      1303
#define P2FEBSC3                      1304
#define P2FEBSC4                      1305
#define P2FEBSIN                      1306
#define PSMC2PHS                      1307
#define P2PHST                        1308
#define P2PHSC1                       1309
#define P2PHSC2                       1310
#define P2PHSC3                       1311
#define P2PHSC4                       1312
#define P2PHSIN                       1313
#define PSMC2DCS                      1314
#define P2DCST                        1315
#define P2DCSC1                       1316
#define P2DCSC2                       1317
#define P2DCSC3                       1318
#define P2DCSC4                       1319
#define P2DCSIN                       1320
#define PSMC2PRS                      1321
#define P2PRST                        1322
#define P2PRSC1                       1323
#define P2PRSC2                       1324
#define P2PRSC3                       1325
#define P2PRSC4                       1326
#define P2PRSIN                       1327
#define PSMC2ASDC                     1328
#define P2ASDOV                       1329
#define P2ARSEN                       1330
#define P2ASDEN                       1331
#define P2ASE                         1332
#define PSMC2ASDL                     1333
#define P2ASDLA                       1334
#define P2ASDLB                       1335
#define PSMC2ASDS                     1336
#define P2ASDSC1                      1337
#define P2ASDSC2                      1338
#define P2ASDSC3                      1339
#define P2ASDSC4                      1340
#define P2ASDSIN                      1341
#define PSMC2INT                      1342
#define P2TPRIF                       1343
#define P2TDCIF                       1344
#define P2TPHIF                       1345
#define P2TOVIF                       1346
#define P2TPRIE                       1347
#define P2TDCIE                       1348
#define P2TPHIE                       1349
#define P2TOVIE                       1350
#define PSMC2PHL                      1351
#define PSMC2PH0                      1352
#define PSMC2PH1                      1353
#define PSMC2PH2                      1354
#define PSMC2PH3                      1355
#define PSMC2PH4                      1356
#define PSMC2PH5                      1357
#define PSMC2PH6                      1358
#define PSMC2PH7                      1359
#define PSMC2PHH                      1360
#define PSMC2PH8                      1361
#define PSMC2PH9                      1362
#define PSMC2PH10                     1363
#define PSMC2PH11                     1364
#define PSMC2PH12                     1365
#define PSMC2PH13                     1366
#define PSMC2PH14                     1367
#define PSMC2PH15                     1368
#define PSMC2DCL                      1369
#define PSMC2DC0                      1370
#define PSMC2DC1                      1371
#define PSMC2DC2                      1372
#define PSMC2DC3                      1373
#define PSMC2DC4                      1374
#define PSMC2DC5                      1375
#define PSMC2DC6                      1376
#define PSMC2DC7                      1377
#define PSMC2DCH                      1378
#define PSMC2DC8                      1379
#define PSMC2DC9                      1380
#define PSMC2DC10                     1381
#define PSMC2DC11                     1382
#define PSMC2DC12                     1383
#define PSMC2DC13                     1384
#define PSMC2DC14                     1385
#define PSMC2DC15                     1386
#define PSMC2PRL                      1387
#define PSMC2PR0                      1388
#define PSMC2PR1                      1389
#define PSMC2PR2                      1390
#define PSMC2PR3                      1391
#define PSMC2PR4                      1392
#define PSMC2PR5                      1393
#define PSMC2PR6                      1394
#define PSMC2PR7                      1395
#define PSMC2PRH                      1396
#define PSMC2PR8                      1397
#define PSMC2PR9                      1398
#define PSMC2PR10                     1399
#define PSMC2PR11                     1400
#define PSMC2PR12                     1401
#define PSMC2PR13                     1402
#define PSMC2PR14                     1403
#define PSMC2PR15                     1404
#define PSMC2TMRL                     1405
#define PSMC2TMR0                     1406
#define PSMC2TMR1                     1407
#define PSMC2TMR2                     1408
#define PSMC2TMR3                     1409
#define PSMC2TMR4                     1410
#define PSMC2TMR5                     1411
#define PSMC2TMR6                     1412
#define PSMC2TMR7                     1413
#define PSMC2TMRH                     1414
#define PSMC2TMR8                     1415
#define PSMC2TMR9                     1416
#define PSMC2TMR10                    1417
#define PSMC2TMR11                    1418
#define PSMC2TMR12                    1419
#define PSMC2TMR13                    1420
#define PSMC2TMR14                    1421
#define PSMC2TMR15                    1422
#define PSMC2DBR                      1423
#define PSMC2DBR0                     1424
#define PSMC2DBR1                     1425
#define PSMC2DBR2                     1426
#define PSMC2DBR3                     1427
#define PSMC2DBR4                     1428
#define PSMC2DBR5                     1429
#define PSMC2DBR6                     1430
#define PSMC2DBR7                     1431
#define PSMC2DBF                      1432
#define PSMC2DBF0                     1433
#define PSMC2DBF1                     1434
#define PSMC2DBF2                     1435
#define PSMC2DBF3                     1436
#define PSMC2DBF4                     1437
#define PSMC2DBF5                     1438
#define PSMC2DBF6                     1439
#define PSMC2DBF7                     1440
#define PSMC2BLKR                     1441
#define PSMC2BLKR0                    1442
#define PSMC2BLKR1                    1443
#define PSMC2BLKR2                    1444
#define PSMC2BLKR3                    1445
#define PSMC2BLKR4                    1446
#define PSMC2BLKR5                    1447
#define PSMC2BLKR6                    1448
#define PSMC2BLKR7                    1449
#define PSMC2BLKF                     1450
#define PSMC2BLKF0                    1451
#define PSMC2BLKF1                    1452
#define PSMC2BLKF2                    1453
#define PSMC2BLKF3                    1454
#define PSMC2BLKF4                    1455
#define PSMC2BLKF5                    1456
#define PSMC2BLKF6                    1457
#define PSMC2BLKF7                    1458
#define PSMC2FFA                      1459
#define PSMC2FFA0                     1460
#define PSMC2FFA1                     1461
#define PSMC2FFA2                     1462
#define PSMC2FFA3                     1463
#define PSMC2STR0                     1464
#define P2STRA                        1465
#define P2STRB                        1466
#define PSMC2STR1                     1467
#define P2HSMEN                       1468
#define P2LSMEN                       1469
#define P2SSYNC                       1470
#define PSMC3CON                      1471
#define P3MODE                        1472
#define P3MODE0                       1473
#define P3MODE1                       1474
#define P3MODE2                       1475
#define P3MODE3                       1476
#define P3DBRE                        1477
#define P3DBFE                        1478
#define PSMC3LD                       1479
#define PSMC3EN                       1480
#define PSMC3MDL                      1481
#define P3MSRC                        1482
#define P3MSRC0                       1483
#define P3MSRC1                       1484
#define P3MSRC2                       1485
#define P3MSRC3                       1486
#define P3MDLBIT                      1487
#define P3MDLPOL                      1488
#define P3MDLEN                       1489
#define PSMC3SYNC                     1490
#define P3SYNC0                       1491
#define P3SYNC1                       1492
#define P3SYNC2                       1493
#define P3DCPOL                       1494
#define P3PRPOL                       1495
#define P3POFST                       1496
#define PSMC3CLK                      1497
#define P3CSRC0                       1498
#define P3CSRC                        1499
#define P3CSRC1                       1500
#define P3CPRE                        1501
#define P3CPRE0                       1502
#define P3CPRE1                       1503
#define PSMC3OEN                      1504
#define P3OEA                         1505
#define P3OEB                         1506
#define P3OEC                         1507
#define P3OED                         1508
#define P3OEE                         1509
#define P3OEF                         1510
#define PSMC3POL                      1511
#define P3POLA                        1512
#define P3POLB                        1513
#define P3POLC                        1514
#define P3POLD                        1515
#define P3POLE                        1516
#define P3POLF                        1517
#define P3INPOL                       1518
#define PSMC3BLNK                     1519
#define P3REBM                        1520
#define P3REBM0                       1521
#define P3REBM1                       1522
#define P3FEBM                        1523
#define P3FEBM0                       1524
#define P3FEBM1                       1525
#define PSMC3REBS                     1526
#define P3REBSC1                      1527
#define P3REBSC2                      1528
#define P3REBSC3                      1529
#define P3REBSC4                      1530
#define P3REBSIN                      1531
#define PSMC3FEBS                     1532
#define P3FEBSC1                      1533
#define P3FEBSC2                      1534
#define P3FEBSC3                      1535
#define P3FEBSC4                      1536
#define P3FEBSIN                      1537
#define PSMC3PHS                      1538
#define P3PHST                        1539
#define P3PHSC1                       1540
#define P3PHSC2                       1541
#define P3PHSC3                       1542
#define P3PHSC4                       1543
#define P3PHSIN                       1544
#define PSMC3DCS                      1545
#define P3DCST                        1546
#define P3DCSC1                       1547
#define P3DCSC2                       1548
#define P3DCSC3                       1549
#define P3DCSC4                       1550
#define P3DCSIN                       1551
#define PSMC3PRS                      1552
#define P3PRST                        1553
#define P3PRSC1                       1554
#define P3PRSC2                       1555
#define P3PRSC3                       1556
#define P3PRSC4                       1557
#define P3PRSIN                       1558
#define PSMC3ASDC                     1559
#define P3ASDOV                       1560
#define P3ARSEN                       1561
#define P3ASDEN                       1562
#define P3ASE                         1563
#define PSMC3ASDL                     1564
#define P3ASDLA                       1565
#define P3ASDLB                       1566
#define P3ASDLC                       1567
#define P3ASDLD                       1568
#define P3ASDLE                       1569
#define P3ASDLF                       1570
#define PSMC3ASDS                     1571
#define P3ASDSC1                      1572
#define P3ASDSC2                      1573
#define P3ASDSC3                      1574
#define P3ASDSC4                      1575
#define P3ASDSIN                      1576
#define PSMC3INT                      1577
#define P3TPRIF                       1578
#define P3TDCIF                       1579
#define P3TPHIF                       1580
#define P3TOVIF                       1581
#define P3TPRIE                       1582
#define P3TDCIE                       1583
#define P3TPHIE                       1584
#define P3TOVIE                       1585
#define PSMC3PHL                      1586
#define PSMC3PH0                      1587
#define PSMC3PH1                      1588
#define PSMC3PH2                      1589
#define PSMC3PH3                      1590
#define PSMC3PH4                      1591
#define PSMC3PH5                      1592
#define PSMC3PH6                      1593
#define PSMC3PH7                      1594
#define PSMC3PHH                      1595
#define PSMC3PH8                      1596
#define PSMC3PH9                      1597
#define PSMC3PH10                     1598
#define PSMC3PH11                     1599
#define PSMC3PH12                     1600
#define PSMC3PH13                     1601
#define PSMC3PH14                     1602
#define PSMC3PH15                     1603
#define PSMC3DCL                      1604
#define PSMC3DC0                      1605
#define PSMC3DC1                      1606
#define PSMC3DC2                      1607
#define PSMC3DC3                      1608
#define PSMC3DC4                      1609
#define PSMC3DC5                      1610
#define PSMC3DC6                      1611
#define PSMC3DC7                      1612
#define PSMC3DCH                      1613
#define PSMC3DC8                      1614
#define PSMC3DC9                      1615
#define PSMC3DC10                     1616
#define PSMC3DC11                     1617
#define PSMC3DC12                     1618
#define PSMC3DC13                     1619
#define PSMC3DC14                     1620
#define PSMC3DC15                     1621
#define PSMC3PRL                      1622
#define PSMC3PR0                      1623
#define PSMC3PR1                      1624
#define PSMC3PR2                      1625
#define PSMC3PR3                      1626
#define PSMC3PR4                      1627
#define PSMC3PR5                      1628
#define PSMC3PR6                      1629
#define PSMC3PR7                      1630
#define PSMC3PRH                      1631
#define PSMC3PR8                      1632
#define PSMC3PR9                      1633
#define PSMC3PR10                     1634
#define PSMC3PR11                     1635
#define PSMC3PR12                     1636
#define PSMC3PR13                     1637
#define PSMC3PR14                     1638
#define PSMC3PR15                     1639
#define PSMC3TMRL                     1640
#define PSMC3TMR0                     1641
#define PSMC3TMR1                     1642
#define PSMC3TMR2                     1643
#define PSMC3TMR3                     1644
#define PSMC3TMR4                     1645
#define PSMC3TMR5                     1646
#define PSMC3TMR6                     1647
#define PSMC3TMR7                     1648
