tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1789_tdd.h
#define PSMC3TMRH                     1649
#define PSMC3TMR8                     1650
#define PSMC3TMR9                     1651
#define PSMC3TMR10                    1652
#define PSMC3TMR11                    1653
#define PSMC3TMR12                    1654
#define PSMC3TMR13                    1655
#define PSMC3TMR14                    1656
#define PSMC3TMR15                    1657
#define PSMC3DBR                      1658
#define PSMC3DBR0                     1659
#define PSMC3DBR1                     1660
#define PSMC3DBR2                     1661
#define PSMC3DBR3                     1662
#define PSMC3DBR4                     1663
#define PSMC3DBR5                     1664
#define PSMC3DBR6                     1665
#define PSMC3DBR7                     1666
#define PSMC3DBF                      1667
#define PSMC3DBF0                     1668
#define PSMC3DBF1                     1669
#define PSMC3DBF2                     1670
#define PSMC3DBF3                     1671
#define PSMC3DBF4                     1672
#define PSMC3DBF5                     1673
#define PSMC3DBF6                     1674
#define PSMC3DBF7                     1675
#define PSMC3BLKR                     1676
#define PSMC3BLKR0                    1677
#define PSMC3BLKR1                    1678
#define PSMC3BLKR2                    1679
#define PSMC3BLKR3                    1680
#define PSMC3BLKR4                    1681
#define PSMC3BLKR5                    1682
#define PSMC3BLKR6                    1683
#define PSMC3BLKR7                    1684
#define PSMC3BLKF                     1685
#define PSMC3BLKF0                    1686
#define PSMC3BLKF1                    1687
#define PSMC3BLKF2                    1688
#define PSMC3BLKF3                    1689
#define PSMC3BLKF4                    1690
#define PSMC3BLKF5                    1691
#define PSMC3BLKF6                    1692
#define PSMC3BLKF7                    1693
#define PSMC3FFA                      1694
#define PSMC3FFA0                     1695
#define PSMC3FFA1                     1696
#define PSMC3FFA2                     1697
#define PSMC3FFA3                     1698
#define PSMC3STR0                     1699
#define P3STRA                        1700
#define P3STRB                        1701
#define P3STRC                        1702
#define P3STRD                        1703
#define P3STRE                        1704
#define P3STRF                        1705
#define PSMC3STR1                     1706
#define P3HSMEN                       1707
#define P3LSMEN                       1708
#define P3SSYNC                       1709
#define PSMC4CON                      1710
#define P4MODE                        1711
#define P4MODE0                       1712
#define P4MODE1                       1713
#define P4MODE2                       1714
#define P4MODE3                       1715
#define P4DBRE                        1716
#define P4DBFE                        1717
#define PSMC4LD                       1718
#define PSMC4EN                       1719
#define PSMC4MDL                      1720
#define P4MSRC                        1721
#define P4MSRC0                       1722
#define P4MSRC1                       1723
#define P4MSRC2                       1724
#define P4MSRC3                       1725
#define P4MDLBIT                      1726
#define P4MDLPOL                      1727
#define P4MDLEN                       1728
#define PSMC4SYNC                     1729
#define P4SYNC0                       1730
#define P4SYNC1                       1731
#define P4SYNC2                       1732
#define P4DCPOL                       1733
#define P4PRPOL                       1734
#define P4POFST                       1735
#define PSMC4CLK                      1736
#define P4CSRC0                       1737
#define P4CSRC                        1738
#define P4CSRC1                       1739
#define P4CPRE0                       1740
#define P4CPRE                        1741
#define P4CPRE1                       1742
#define PSMC4OEN                      1743
#define P4OEA                         1744
#define P4OEB                         1745
#define PSMC4POL                      1746
#define P4POLA                        1747
#define P4POLB                        1748
#define P4INPOL                       1749
#define PSMC4BLNK                     1750
#define P4REBM0                       1751
#define P4REBM                        1752
#define P4REBM1                       1753
#define P4FEBM0                       1754
#define P4FEBM                        1755
#define P4FEBM1                       1756
#define PSMC4REBS                     1757
#define P4REBSC1                      1758
#define P4REBSC2                      1759
#define P4REBSC3                      1760
#define P4REBSC4                      1761
#define P4REBSIN                      1762
#define PSMC4FEBS                     1763
#define P4FEBSC1                      1764
#define P4FEBSC2                      1765
#define P4FEBSC3                      1766
#define P4FEBSC4                      1767
#define P4FEBSIN                      1768
#define PSMC4PHS                      1769
#define P4PHST                        1770
#define P4PHSC1                       1771
#define P4PHSC2                       1772
#define P4PHSC3                       1773
#define P4PHSC4                       1774
#define P4PHSIN                       1775
#define PSMC4DCS                      1776
#define P4DCST                        1777
#define P4DCSC1                       1778
#define P4DCSC2                       1779
#define P4DCSC3                       1780
#define P4DCSC4                       1781
#define P4DCSIN                       1782
#define PSMC4PRS                      1783
#define P4PRST                        1784
#define P4PRSC1                       1785
#define P4PRSC2                       1786
#define P4PRSC3                       1787
#define P4PRSC4                       1788
#define P4PRSIN                       1789
#define PSMC4ASDC                     1790
#define P4ASDOV                       1791
#define P4ARSEN                       1792
#define P4ASDEN                       1793
#define P4ASE                         1794
#define PSMC4ASDL                     1795
#define P4ASDLA                       1796
#define P4ASDLB                       1797
#define PSMC4ASDS                     1798
#define P4ASDSC1                      1799
#define P4ASDSC2                      1800
#define P4ASDSC3                      1801
#define P4ASDSC4                      1802
#define P4ASDSIN                      1803
#define PSMC4INT                      1804
#define P4TPRIF                       1805
#define P4TDCIF                       1806
#define P4TPHIF                       1807
#define P4TOVIF                       1808
#define P4TPRIE                       1809
#define P4TDCIE                       1810
#define P4TPHIE                       1811
#define P4TOVIE                       1812
#define PSMC4PHL                      1813
#define PSMC4PH0                      1814
#define PSMC4PH1                      1815
#define PSMC4PH2                      1816
#define PSMC4PH3                      1817
#define PSMC4PH4                      1818
#define PSMC4PH5                      1819
#define PSMC4PH6                      1820
#define PSMC4PH7                      1821
#define PSMC4PHH                      1822
#define PSMC4PH8                      1823
#define PSMC4PH9                      1824
#define PSMC4PH10                     1825
#define PSMC4PH11                     1826
#define PSMC4PH12                     1827
#define PSMC4PH13                     1828
#define PSMC4PH14                     1829
#define PSMC4PH15                     1830
#define PSMC4DCL                      1831
#define PSMC4DC0                      1832
#define PSMC4DC1                      1833
#define PSMC4DC2                      1834
#define PSMC4DC3                      1835
#define PSMC4DC4                      1836
#define PSMC4DC5                      1837
#define PSMC4DC6                      1838
#define PSMC4DC7                      1839
#define PSMC4DCH                      1840
#define PSMC4DC8                      1841
#define PSMC4DC9                      1842
#define PSMC4DC10                     1843
#define PSMC4DC11                     1844
#define PSMC4DC12                     1845
#define PSMC4DC13                     1846
#define PSMC4DC14                     1847
#define PSMC4DC15                     1848
#define PSMC4PRL                      1849
#define PSMC4PR0                      1850
#define PSMC4PR1                      1851
#define PSMC4PR2                      1852
#define PSMC4PR3                      1853
#define PSMC4PR4                      1854
#define PSMC4PR5                      1855
#define PSMC4PR6                      1856
#define PSMC4PR7                      1857
#define PSMC4PRH                      1858
#define PSMC4PR8                      1859
#define PSMC4PR9                      1860
#define PSMC4PR10                     1861
#define PSMC4PR11                     1862
#define PSMC4PR12                     1863
#define PSMC4PR13                     1864
#define PSMC4PR14                     1865
#define PSMC4PR15                     1866
#define PSMC4TMRL                     1867
#define PSMC4TMR0                     1868
#define PSMC4TMR1                     1869
#define PSMC4TMR2                     1870
#define PSMC4TMR3                     1871
#define PSMC4TMR4                     1872
#define PSMC4TMR5                     1873
#define PSMC4TMR6                     1874
#define PSMC4TMR7                     1875
#define PSMC4TMRH                     1876
#define PSMC4TMR8                     1877
#define PSMC4TMR9                     1878
#define PSMC4TMR10                    1879
#define PSMC4TMR11                    1880
#define PSMC4TMR12                    1881
#define PSMC4TMR13                    1882
#define PSMC4TMR14                    1883
#define PSMC4TMR15                    1884
#define PSMC4DBR                      1885
#define PSMC4DBR0                     1886
#define PSMC4DBR1                     1887
#define PSMC4DBR2                     1888
#define PSMC4DBR3                     1889
#define PSMC4DBR4                     1890
#define PSMC4DBR5                     1891
#define PSMC4DBR6                     1892
#define PSMC4DBR7                     1893
#define PSMC4DBF                      1894
#define PSMC4DBF0                     1895
#define PSMC4DBF1                     1896
#define PSMC4DBF2                     1897
#define PSMC4DBF3                     1898
#define PSMC4DBF4                     1899
#define PSMC4DBF5                     1900
#define PSMC4DBF6                     1901
#define PSMC4DBF7                     1902
#define PSMC4BLKR                     1903
#define PSMC4BLKR0                    1904
#define PSMC4BLKR1                    1905
#define PSMC4BLKR2                    1906
#define PSMC4BLKR3                    1907
#define PSMC4BLKR4                    1908
#define PSMC4BLKR5                    1909
#define PSMC4BLKR6                    1910
#define PSMC4BLKR7                    1911
#define PSMC4BLKF                     1912
#define PSMC4BLKF0                    1913
#define PSMC4BLKF1                    1914
#define PSMC4BLKF2                    1915
#define PSMC4BLKF3                    1916
#define PSMC4BLKF4                    1917
#define PSMC4BLKF5                    1918
#define PSMC4BLKF6                    1919
#define PSMC4BLKF7                    1920
#define PSMC4FFA                      1921
#define PSMC4FFA0                     1922
#define PSMC4FFA1                     1923
#define PSMC4FFA2                     1924
#define PSMC4FFA3                     1925
#define PSMC4STR0                     1926
#define P4STRA                        1927
#define P4STRB                        1928
#define PSMC4STR1                     1929
#define P4HSMEN                       1930
#define P4LSMEN                       1931
#define P4SSYNC                       1932
#define STATUS_SHAD                   1933
#define C_SHAD                        1934
#define DC_SHAD                       1935
#define Z_SHAD                        1936
#define WREG_SHAD                     1937
#define BSR_SHAD                      1938
#define PCLATH_SHAD                   1939
#define FSR0L_SHAD                    1940
#define FSR0H_SHAD                    1941
#define FSR1L_SHAD                    1942
#define FSR1H_SHAD                    1943
#define STKPTR                        1944
#define TOSL                          1945
#define TOSH                          1946

#endif // _PIC16LF1789_H_
